harmony.common.security/target/classes/data/CancelReservation.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">http://10.1.3.201:8080/harmony-adapter-uclp/services/Reservation</wsa:To>
        <wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">http://ist_phosphorus.eu/nsp/webservice/reservation/cancelReservation</wsa:Action>
        <wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">uuid:a174e360-42b0-3f7f-2494-59a9cbf2d53a</wsa:MessageID>
        <wsa:From xmlns:wsa="http://www.w3.org/2005/08/addressing">
            <wsa:Address>http://www.w3.org/2005/08/addressing/role/anonymous</wsa:Address>
        </wsa:From>
    </soap:Header>
    <soap:Body>
        <pfx0:cancelReservation xmlns:pfx0="http://ist_phosphorus.eu/nsp/webservice/reservation">
            <pfx0:cancelReservation
                xmlns="http://ist_phosphorus.eu/nsp/webservice/topology"
                xmlns:ns2="http://ist_phosphorus.eu/nsp"
                xmlns:ns3="http://ist_phosphorus.eu/nsp/webservice/notification"
                xmlns:ns4="http://ist_phosphorus.eu/nsp/webservice/reservation"
                xmlns:ns5="http://www.w3.org/2005/08/addressing" xmlns:ns6="http://docs.oasis-open.org/wsrf/bf-2">
                <ns4:cancelReservation xmlns:ns4="http://ist_phosphorus.eu/nsp/webservice/reservation">
                    <ns4:ReservationID>539</ns4:ReservationID>
                    <ns4:Token>26ad75c13c124195695ed4a145f4a35e9d3f5790</ns4:Token>
                </ns4:cancelReservation>
            </pfx0:cancelReservation>
        </pfx0:cancelReservation>
    </soap:Body>
</soap:Envelope>
